from aiogram.fsm.context import FSMContext
from aiogram.types import Message

from keyboards.back_keyboard import back_button
from states.menu_states import MenuState


async def help_menu(message: Message, state: FSMContext):
    """ Ответы на вопросы """
    await state.set_state(MenuState.help_menu)
    await message.answer(text=f'Привет, любитель кофе и звёзд! ✨\n'
                              f'Этот бот знает, какой напиток и гороскоп тебе подарят сегодня удачу.\n\n'
                              f'🔮 Гороскоп на день – узнай, что приготовили для тебя звёзды и какой '
                              f'кофе стоит попробовать.\n'
                              f'💫 Знак зодиака – расскажи нам свой, и мы подскажем идеальный '
                              f'напиток по космическому настроению.\n'
                              f'🌟Секретное предложение – иногда бот дарит особенные кофейные предсказания!\n\n'
                              f'🪄Но самое волшебство ждёт тебя в нашей кофейне – там бариста-🧚‍♀️ '
                              f'приготовит не просто кофе, а настроение, заряженное звёздами.\n'
                              f'Приходи, помечтаем вместе! ❤️️',
                         reply_markup=back_button())
